/*******************************
 function ：延时函数
Clock F  :7.3728M 
Software : ICCAVR7.14C
********************************/
/*---------------------------------------------------------------------------------
     延时程序计算方法
     计数个数j = 延时时间/6*晶振频率 - 1
---------------------------------------------------------------------------------*/
void delayus(unsigned int tttt)   // 1.2us 延时子函数   
{ 
   do
   {
       tttt--;
   }
   while(tttt>1);
}
void delayms(unsigned int i)                 //1ms延时
   {
    while(i--)
    {                          
	    unsigned int j;                
        for(j=1;j<=1227;j++)   
			   ;               
    }                       
   }