//*****************************************************************************//
//*								 
//*控制芯片：ATmgea128
//*开发环境：AVR Studio+GCC
//*隶属模块：SPI接口控制
//*****************************************************************************//
#include "SPI.h"

/******************************************************************
SPI接口函数初始化
******************************************************************/
void SPI_IO_Init(void)
{
	SPI_PORT |= (1<<SS);////拉高CS
	SPI_DDR |= (1<<SCLK)|(1<<MOSI)|(1<<SS);////CS,CLK,MOSI设为输出
	SPI_DDR &=~(1<<MISO);//MISO设为输入
	SPI_PORT |= (1<<SCLK);//拉高CLK
	SPI_High();//SPI高通
}
/******************************************************************
SPI写一个字节
******************************************************************/
void SPI_Write(UINT8 data)
{
	SPDR = data;
	while ((SPSR&(1<<SPIF))==0);
	//loop_until_bit_is_set(SPSR,SPIF);
}
/******************************************************************
SPI读一个字节
******************************************************************/
unsigned char SPI_Read(void)
{
	SPDR = 0xFF;//写0xFF启动SPI
	while ((SPSR&(1<<SPIF))==0);
	//loop_until_bit_is_set(SPSR,SPIF);//等待SPIF为高电平
	return  SPDR;//返回读取值
}


